app/views/inventory_foods/new.html.erb

  <%= form.label :food_id, 'Select food' %>
  <%= form.collection_select :food_id, Food.all, :id, :name, include_blank: true %>
---
SELECT "foods".* FROM "foods"