app/views/shopping_lists/new.html.erb

      <br /> <br />
      <%= form.collection_select :inventory_id, Inventory.all, :id, :name, include_blank: 'select inventory' %>
---
SELECT "inventories".* FROM "inventories"