app/views/recipe_foods/new.html.erb

    <%= form.label :food_id, 'Select Food' %>
    <%= form.collection_select :food_id, Food.all, :id, :name, include_blank: true %>
---
SELECT "foods".* FROM "foods"