app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @food = Food.find(params[:id])

INSERT INTO "foods" ("name", "measurement_unit", "price", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "katogo"], ["measurement_unit", "kg"], ["price", 1000.0], ["created_at", "2024-04-19 10:52:32.859773"], ["updated_at", "2024-04-19 10:52:32.859773"], ["user_id", 1]]
---
  def create
    @user = current_user
    @food = @user.foods.new(food_params)

    if @food.save

SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1 AND "foods"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
---
  def edit
    @food = current_user.foods.find(params[:id])

SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1 AND "foods"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "foods" SET "name" = $1, "updated_at" = $2 WHERE "foods"."id" = $3  [["name", "kato"], ["updated_at", "2024-04-19 12:01:26.405448"], ["id", 1]]
---
  def update
    @food = current_user.foods.find(params[:id])

    if @food.update(food_params)

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 1]]
---
  def destroy
    @food = Food.find(params[:id])
    @food.destroy