app/controllers/inventory_foods_controller.rb

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @inventory_food = InventoryFood.find(params[:id])

INSERT INTO "inventory_foods" ("inventory_id", "food_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["inventory_id", 1], ["food_id", 3], ["quantity", 5.0], ["created_at", "2024-05-01 18:59:33.486480"], ["updated_at", "2024-05-01 18:59:33.486480"]]
---
  def create
    @inventory_food = @inventory.inventory_foods.build(inventory_food_params)
    if @inventory_food.save

DELETE FROM "inventory_foods" WHERE "inventory_foods"."id" = $1  [["id", 6]]
---
  def destroy
    @inventory_food.destroy

SELECT "inventories".* FROM "inventories" WHERE "inventories"."user_id" = $1 AND "inventories"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
---
  def set_inventory
    @inventory = current_user.inventories.find_by(id: params[:inventory_id])

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "inventory_foods".* FROM "inventory_foods" WHERE "inventory_foods"."inventory_id" = $1 AND "inventory_foods"."id" = $2 LIMIT $3  [["inventory_id", 2], ["id", 6], ["LIMIT", 1]]
---
  def set_inventory_food
    @inventory_food = @inventory.inventory_foods.find(params[:id])