app/controllers/inventories_controller.rb

SELECT "inventories".* FROM "inventories"
---
  def index
    @inventories = Inventory.all

SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "inventory_foods".* FROM "inventory_foods" WHERE "inventory_foods"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def show
    @inventory = Inventory.find(params[:id])
    @inventory_foods = @inventory.inventory_foods.all

INSERT INTO "inventories" ("name", "user_id", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "gwebe"], ["user_id", 2], ["created_at", "2024-05-29 14:39:33.027280"], ["updated_at", "2024-05-29 14:39:33.027280"], ["description", "dadadalop"]]
---
  def create
    @inventory = current_user.inventories.new(inventory_params)
    if @inventory.save

SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "inventories" WHERE "inventories"."id" = $1  [["id", 2]]
---
  def destroy
    @inventory = Inventory.find(params[:id])
    @inventory.destroy