app/controllers/public_recipes_controller.rb

  def index
    @recipes = Recipe.includes(:user, :recipe_foods).where(public: true)

    @recipes_data = @recipes.map do |recipe|
      total_items = recipe.recipe_foods.count(:quantity)
      total_price = recipe.recipe_foods.joins(:food).sum('foods.price')
---
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" IN ($1, $2)  [["recipe_id", 2], ["recipe_id", 3]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."public" = $1  [["public", true]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
SELECT COUNT("recipe_foods"."quantity") FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 2]]
SELECT SUM("foods"."price") FROM "recipe_foods" INNER JOIN "foods" ON "foods"."id" = "recipe_foods"."food_id" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 2]]