app/controllers/public_recipes_controller.rb

  def index
    @recipes = Recipe.includes(:user).where(public: true)
    @user_food_count = current_user.foods.count
    @user_food_total_price = current_user.foods.sum(:price)
---
SELECT COUNT(*) FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 1]]
SELECT SUM("foods"."price") FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 1]]