app/controllers/recipe_foods_controller.rb

  def show
    @recipe_food = RecipeFood.find(params[:id])
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    @recipe_food = @recipe.recipe_foods.build(recipe_food_params)

    if @recipe_food.save
---
INSERT INTO "recipe_foods" ("recipe_id", "food_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["recipe_id", 3], ["food_id", 3], ["quantity", 50.0], ["created_at", "2024-04-25 19:22:39.026662"], ["updated_at", "2024-04-25 19:22:39.026662"]]

  def destroy
    @recipe_food.destroy
---
DELETE FROM "recipe_foods" WHERE "recipe_foods"."id" = $1  [["id", 4]]

  def set_recipe
    @recipe = current_user.recipes.find_by(id: params[:recipe_id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1 AND "recipes"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 2], ["LIMIT", 1]]

  def set_recipe_food
    @recipe_food = @recipe.recipe_foods.find(params[:id])
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1 AND "recipe_foods"."id" = $2 LIMIT $3  [["recipe_id", 3], ["id", 4], ["LIMIT", 1]]