app/controllers/shopping_lists_controller.rb

  def index
    @shopping_list = ShoppingList.all
---
SELECT "shopping_lists".* FROM "shopping_lists"

  def show
    @shopping_list = ShoppingList.find(params[:id])
---
SELECT "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def create
    @shopping_list = @recipe.shopping_lists.build(shopping_list_params)
    if @shopping_list.save
---
INSERT INTO "shopping_lists" ("recipe_id", "inventory_id", "name", "quantity", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["recipe_id", 3], ["inventory_id", 2], ["name", nil], ["quantity", nil], ["price", nil], ["created_at", "2024-04-28 17:44:16.635936"], ["updated_at", "2024-04-28 17:44:16.635936"]]

  def set_recipe
    @recipe = current_user.recipes.find_by(id: params[:recipe_id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1 AND "recipes"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 3], ["LIMIT", 1]]