app/controllers/shopping_lists_controller.rb

  def set_recipe
    @recipe = current_user.recipes.find_by(id: params[:recipe_id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1 AND "recipes"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 3], ["LIMIT", 1]]