app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @user_public_recipe = @user.recipes.where(public:true)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1 AND "recipes"."public" = $2  [["user_id", 1], ["public", true]]