app/models/shopping_list.rb

SELECT "foods".* FROM "foods" INNER JOIN "recipe_foods" ON "foods"."id" = "recipe_foods"."food_id" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 3]]
SELECT "inventory_foods".* FROM "inventory_foods" WHERE "inventory_foods"."inventory_id" = $1 AND "inventory_foods"."food_id" = $2 LIMIT $3  [["inventory_id", 2], ["food_id", 3], ["LIMIT", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."food_id" = $1  [["food_id", 3]]
SELECT "foods".* FROM "foods" INNER JOIN "recipe_foods" ON "foods"."id" = "recipe_foods"."food_id" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "inventory_foods".* FROM "inventory_foods" WHERE "inventory_foods"."food_id" IN ($1, $2)  [["food_id", 5], ["food_id", 7]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."food_id" IN ($1, $2)  [["food_id", 5], ["food_id", 7]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def missing_items
    return @missing_items if defined?(@missing_items)

    @missing_items = []
    recipe.foods.includes(:recipe_foods, :inventory_foods).each do |food|
      recipe_food = food.recipe_foods.find { |rf| rf.recipe_id == recipe.id }
      inventory_food = food.inventory_foods.find { |ifood| ifood.inventory_id == inventory.id }