app/models/shopping_list.rb

SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def find_inventory_food(food)
    food.inventory_foods.find { |ifood| ifood.inventory_id == inventory.id }